#include <stdio.h>
#include <stdlib.h>

int main() {
	//int ret = 1 + 2 * 3;

	//int a = 0;
	//int a = 0;

	//int n = 0;
	//printf("%d\n", 10 % 0);

	// printf("%f\n", 10.5 % 2.0);

	//printf("%d\n", 1 / 2);

	//double a = 1.75;
	// 打印 2 结果
	//printf("%d\n", func(a));

	// 按位与运算
	// 如果两个操作数都是 0, 结果为 0
	// 如果两个操作数都为 1, 结果为 1
	// 如果一个操作数为 0, 一个为 1, 结果为 0
	//int a = 1;   // 01
	//int b = 2;   // 10
	//printf("%d\n", a & b);

	// 按位或运算
	// 如果两个操作数都是 0, 结果为 0
	// 如果两个操作数都为 1, 结果为 1
	// 如果一个操作数为 0, 一个为 1, 结果为 1
	//int a = 1;  // 01
	//int b = 2;  // 10
	//printf("%d\n", a | b);

	// 按位异或运算
	// 相同为 0, 相异为 1
	//int a = 1;  // 01
	//int b = 2;	// 10
	//printf("%d\n", a ^ b);

	// 按位取反
	// 如果该位为 0, 变成 1; 如果该位为 1, 变成 0
	//int a = 1;  
	// %x 是按照十六进制打印数字. 十六进制是二进制的简化表示方式. 
	//printf("%x\n", ~a);

	// 不使用临时变量交换两个整数
	int a = 10;
	int b = 20;

	//a = a + b;  // 30    20
	//b = a - b;  // 30    10
	//a = a - b;  // 20    10
	// 如果 a 和 b 的值很大, 可能导致出现溢出的情况. 

	// 01010   
	// 10100   b
	// 11110   a
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;
	printf("%d %d\n", a, b);

	system("pause");
	return 0;
}